In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

## List all the tables

In [3]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

def tables_in_sqlite_db(conn):
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [
        v[0] for v in cursor.fetchall()
        if v[0] != "sqlite_sequence"
    ]
    cursor.close()
    return tables

tables = tables_in_sqlite_db(connection)
for i in tables:
    print(i)

top30
a20210407a
a20210408a
a20210409a
ER20210410a
ER20210411a
ER20210412a
ER20210413a
ER20210414a
ER20210415
ER20210416
ER20210417
ER20210418
ER20210419
ER20210420
ER20210421
ER20210422
ER20210423
ER20210424
ER20210425
ER20210426
ER20202021
ER20210427
ER20210428
ER20210429
ER20210430
ER20210501
ER20210502
ER20210503
ER20210504
ER20210505
ER20210506
ER20210507
DJI
SP500
ER20210508
ER20210509
ER20210510
ER20210511
ER20210512
ER20210513
reddit_old
main
ER20210514
ER20210515
ER20210516
SP500_companies
ER20210517
ER20210518
prices
ER20210519
ER20210520
ER20210521
ER20210522

In [13]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ("Select * from prices order by date desc")
df = pd.read_sql_query(sql,connection)
df

,date,open,high,low,close,adj_close,volume,symbol
0,2021-05-21 00:00:00,127.82,128.00,125.21,125.43,125.43,"79,209,300",AAPL
1,2021-05-21 00:00:00,247.57,248.33,244.74,245.17,245.17,"21,855,500",MSFT
2,2021-05-21 00:00:00,"3,250.00","3,256.69","3,197.01","3,203.08","3,203.08","4,097,800",AMZN
3,2021-05-21 00:00:00,319.29,319.93,315.81,316.23,316.23,"13,562,700",FB
4,2021-05-21 00:00:00,"2,317.41","2,318.89","2,289.30","2,294.13","2,294.13","2,030,700",GOOGL
...,...,...,...,...,...,...,...,...
52463,2020-12-21 00:00:00,110.71,113.78,108.73,112.54,112.54,"3,809,700",WYNN
52464,2020-12-21 00:00:00,146.80,148.06,141.70,145.28,145.28,"1,799,300",XLNX
52465,2020-12-21 00:00:00,366.00,376.73,363.00,375.91,375.91,"505,600",ZBRA
52466,2020-12-21 00:00:00,"30,159.00","30,304.14","29,755.53","30,216.45","30,216.45","437,480,000",^DJI
52467,2020-12-21 00:00:00,"3,684.28","3,702.90","3,636.48","3,694.92","3,694.92","4,732,160,000",^GSPC

In [94]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ("Select * from SP500_companies ")
df = pd.read_sql_query(sql,connection)
df

                          Company Symbol      Weight
0                      Apple Inc.   AAPL    5.664493
1           Microsoft Corporation   MSFT    5.264839
2                 Amazon.com Inc.   AMZN    3.886738
3           Facebook Inc. Class A     FB    2.109076
4           Alphabet Inc. Class A  GOOGL    1.925453
..                            ...    ...         ...
504     Under Armour Inc. Class C     UA    0.010361
505      News Corporation Class B    NWS    0.008590
506                       S&P 500  ^GSPC  100.000000
507  Dow Jones Industrial Average   ^DJI  100.000000
508         Continental Resources    CLR    0.000000

[509 rows x 3 columns]

In [93]:
df[df.Symbol == "CLR"]

                   Company Symbol  Weight
508  Continental Resources    CLR     0.0
509  Continental Resources    CLR     0.0

In [62]:
df[193:]

                               Company Symbol      Weight
193     Marathon Petroleum Corporation    MPC    0.110018
194  Microchip Technology Incorporated   MCHP    0.109975
195       Alexion Pharmaceuticals Inc.   ALXN    0.109500
196                  MSCI Inc. Class A   MSCI    0.109434
197                          eBay Inc.   EBAY    0.109125
..                                 ...    ...         ...
503          Under Armour Inc. Class A    UAA    0.011972
504          Under Armour Inc. Class C     UA    0.010361
505           News Corporation Class B    NWS    0.008590
506                            S&P 500  ^GSPC  100.000000
507       Dow Jones Industrial Average   ^DJI  100.000000

[315 rows x 3 columns]

In [52]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = (''' select * from prices 
--where date == "2021-05-19 00:00:00"

''')
price = pd.read_sql_query(sql,connection)
print(price.shape)
price.head()

(52468, 8)

,date,open,high,low,close,adj_close,volume,symbol
0,2021-05-17 00:00:00,130.84,131.05,129.91,130.11,130.11,"886,700",A
1,2021-05-17 00:00:00,22.32,23.40,22.10,23.35,23.35,"40,584,200",AAL
2,2021-05-17 00:00:00,203.91,204.76,202.01,204.58,204.58,"825,300",AAP
3,2021-05-17 00:00:00,126.82,126.93,125.17,126.27,126.27,"74,163,100",AAPL
4,2021-05-17 00:00:00,116.77,117.71,116.56,116.89,116.89,"6,182,300",ABBV

price

In [53]:
price[price.open == "Stock Split"]

Empty DataFrame
Columns: [date, open, high, low, close, adj_close, volume, symbol]
Index: []

In [54]:
price[price.open == "Dividend"]

Empty DataFrame
Columns: [date, open, high, low, close, adj_close, volume, symbol]
Index: []

In [96]:
## Duplicates

connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ('''select symbol, date, XX as count, AM 
from (Select symbol, date, COUNT(symbol) OVER(PARTITION BY symbol, date) as XX ,ROW_NUMBER() OVER(PARTITION BY symbol, date) as AM from prices) where XX > 1''')
df = pd.read_sql_query(sql,connection)
print(df.shape)
df.head()

(10, 4)

  symbol                 date  count  AM
0    KHC  2021-05-19 00:00:00      2   1
1    KHC  2021-05-19 00:00:00      2   2
2    KSU  2021-05-19 00:00:00      2   1
3    KSU  2021-05-19 00:00:00      2   2
4    LYB  2021-05-19 00:00:00      2   1

In [25]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = (''' select date(date), * from prices 
where symbol = "AAPL"
order by date desc

''')
price = pd.read_sql_query(sql,connection)
print(price.shape)
price.head()

(101, 9)

,date(date),date,open,high,low,close,adj_close,volume,symbol
0,2021-05-19,2021-05-19 00:00:00,123.16,124.92,122.86,124.69,124.69,"92,499,900",AAPL
1,2021-05-18,2021-05-18 00:00:00,126.56,126.99,124.78,124.85,124.85,"63,130,600",AAPL
2,2021-05-17,2021-05-17 00:00:00,126.82,126.93,125.17,126.27,126.27,"74,163,100",AAPL
3,2021-05-14,2021-05-14 00:00:00,126.25,127.89,125.85,127.45,127.45,"81,806,500",AAPL
4,2021-05-13,2021-05-13 00:00:00,124.58,126.15,124.26,124.97,124.97,"105,861,300",AAPL

In [88]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ("Select symbol, date from prices order by date desc")
df = pd.read_sql_query(sql,connection)
df

      symbol                 date
0       AAPL  2021-05-21 00:00:00
1       MSFT  2021-05-21 00:00:00
2       AMZN  2021-05-21 00:00:00
3         FB  2021-05-21 00:00:00
4      GOOGL  2021-05-21 00:00:00
...      ...                  ...
52562   WYNN  2020-12-21 00:00:00
52563   XLNX  2020-12-21 00:00:00
52564   ZBRA  2020-12-21 00:00:00
52565   ^DJI  2020-12-21 00:00:00
52566  ^GSPC  2020-12-21 00:00:00

[52567 rows x 2 columns]

In [97]:
for date in df.date.unique():

    connection = sqlite3.connect('MSC.db')
    cursor = connection.cursor()
    sql = (f"Select symbol from SP500_companies where symbol not in (select symbol from prices where date = '{date}') and symbol not in ('BRK.B', 'BF.B', 'FLIR')")
    miss = pd.read_sql_query(sql,connection)
    if len(list(miss.Symbol))>0:
        print(date)
        print(list(miss.Symbol))

In [82]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()

sql = (f'''
Select symbol from SP500_companies 
where symbol not in (select distinct symbol from prices where date == "2021-05-21 00:00:00")
and  symbol not in ('BRK.B', 'BF.B', 'FLIR')'''
    )
df = pd.read_sql_query(sql,connection)
df

Empty DataFrame
Columns: [Symbol]
Index: []

## Delete

connection = sqlite3.connect('MSC.db') 
cursor = connection.cursor() 
sql = ("delete from SP500_companies where symbol = 'CLR'") 
cursor.execute(sql) 
connection.commit()

## DF to SQL 

connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
df_distinct.to_sql('prices', connection, index = False)
connection.commit()
connection.close()

## ADD NEW COMERS

import pandas as pd
import requests
from datetime import datetime
import datetime
import sqlite3
import praw
from bs4 import BeautifulSoup
import re
import locale
locale.setlocale(locale.LC_ALL, 'en_US.UTF-8')


columnnames = "'date', 'open', 'high', 'low', 'close', 'adj_close','volume', 'symbol'"
insertintotable = '?,?,?,?,?,?,?,?'
i = 'CLR'

r = requests.get(f'https://finance.yahoo.com/quote/{i}/history?p={i}')
data = r.text
soup = BeautifulSoup(data, features="lxml")

for j in range (0, len(soup.find_all('td'))):
    try:
        if (type(pd.to_datetime(soup.find_all('td')[j].text,infer_datetime_format=True)) == pd._libs.tslibs.timestamps.Timestamp) == True and isinstance(locale.atof(soup.find_all('td')[j+1].text), (int, float, complex)) == True:
            answer = []
            answer.append(str(pd.to_datetime(soup.find_all('td')[j].text,infer_datetime_format=True)))
            answer = answer + [i.span.text for i in soup.find_all('td')[j+1: j+7]] + [i]
            print(answer)
            connection = sqlite3.connect('MSC.db')
            cursor = connection.cursor()
            sql2 = f'cursor.execute("insert INTO  prices ({columnnames}) VALUES ({insertintotable})", {answer})'
            eval(sql2)
            connection.commit()
            connection.close()
        else: pass
    except:pass

## Drop table

#https://www.sqlite.org/datatype3.html
cursor.executescript("DROP TABLE IF EXISTS prices")

In [ ]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

sql = ('Select date(moment) as date, * from ER20202021')
z =pd.read_sql_query(sql,connection)
z.shape

## Alter

connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

sql = ('ALTER TABLE top30 RENAME COLUMN date TO Date')
pd.read_sql_query(sql,connection)

## Add new rows

columnnames = "'Company', 'Symbol', 'Weight'"
insertintotable = '?,?,?'
answer = ['Continental Resources','CLR', '0']

connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql2 = f'cursor.execute("insert INTO  SP500_companies ({columnnames}) VALUES ({insertintotable})", {answer})'
eval(sql2)
connection.commit()
connection.close()

In [ ]:
#Transfer to main folder
import shutil
newPath = shutil.copy('MSC.db', '/Users/Edite')